tap "adoptopenjdk/openjdk"
tap "cloudflare/cloudflare"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "isen-ng/dotnet-sdk-versions"
tap "oven-sh/bun"
tap "pirj/noclamshell"
tap "tclass/cloud_sql_proxy"
tap "xcodesorg/made"
brew "act"
brew "libpng"
brew "glib"
brew "pkg-config"
brew "cairo"
brew "harfbuzz"
brew "little-cms2"
brew "openjdk"
brew "ant"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "aria2"
brew "asciinema"
brew "automake"
brew "docutils"
brew "python@3.11"
brew "awscli"
brew "bash"
brew "bat"
brew "coreutils"
brew "bats-core"
brew "boost"
brew "bundletool"
brew "carthage"
brew "ccache"
brew "chezmoi"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "cocoapods"
brew "coq"
brew "ctags"
brew "curl"
brew "direnv"
brew "drone-cli"
brew "duckdb"
brew "libsodium"
brew "folly"
brew "edencommon"
brew "elan-init"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "esbuild"
brew "fizz"
brew "wangle"
brew "fb303"
brew "fbthrift"
brew "fcl"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "gd"
brew "gdk-pixbuf"
brew "geos"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "gnupg"
brew "qt"
brew "gnuplot"
brew "go"
brew "gobject-introspection"
brew "gping"
brew "netpbm"
brew "librsvg"
brew "libtool"
brew "graphviz"
brew "grep"
brew "z3"
brew "halide"
brew "helix"
brew "htop"
brew "httpie"
brew "hugo"
brew "libheif"
brew "python@3.9"
brew "imagemagick"
brew "jpeg", link: true
brew "jq"
brew "python@3.10"
brew "jsonschema"
brew "libgsf"
brew "libiconv"
brew "libimobiledevice"
brew "libpq"
brew "libxml2"
brew "libzip"
brew "llvm"
brew "make"
brew "maven"
brew "mdbook"
brew "mint"
brew "mkcert"
brew "nghttp2"
brew "ninja"
brew "opam"
brew "openjdk@11"
brew "openapi-generator"
brew "openslide"
brew "pandoc"
brew "peco"
brew "perl"
brew "perltidy"
brew "pinentry-mac"
brew "plantuml"
brew "virtualenv"
brew "poetry"
brew "poppler"
brew "proj"
brew "protobuf"
brew "protoc-gen-grpc-web"
brew "pssh"
brew "pyenv"
brew "qemu"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "ruby@2.6"
brew "rye"
brew "scrcpy"
brew "silicon"
brew "smartmontools"
brew "speedtest-cli"
brew "sphinx-doc"
brew "starship"
brew "swift-format"
brew "swiftlint"
brew "tcl-tk"
brew "tldr"
brew "tree"
brew "vim"
brew "volta"
brew "watchman"
brew "wget"
brew "youtube-dl"
brew "zig"
brew "zlib"
brew "cloudflare/cloudflare/cloudflared"
brew "go-task/tap/go-task"
brew "oven-sh/bun/bun"
brew "pirj/noclamshell/noclamshell"
brew "tclass/cloud_sql_proxy/cloud_sql_proxy"
brew "xcodesorg/made/xcodes"
cask "adoptopenjdk8"
cask "appcleaner"
cask "bloomrpc"
cask "chromium"
cask "dotnet-sdk3-1-400"
cask "dteoh-devdocs"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "inkscape"
cask "mactex"
cask "ngrok"
cask "qlcolorcode"
cask "raycast"
cask "react-native-debugger"
cask "temurin"
vscode "akamud.vscode-theme-onelight"
vscode "bierner.comment-tagged-templates"
vscode "bierner.markdown-preview-github-styles"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fwcd.kotlin"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "haskell.haskell"
vscode "James-Yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jpoissonnier.vscode-styled-components"
vscode "justusadam.language-haskell"
vscode "leanprover.lean4"
vscode "lysnikolaou.pegen-peg"
vscode "marchrock.vscode-ghq"
vscode "marp-team.marp-vscode"
vscode "matepek.vscode-catch2-test-adapter"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "ndmitchell.haskell-ghcid"
vscode "njpwerner.autodocstring"
vscode "pbkit.vscode-pbkit"
vscode "Prisma.prisma"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "RReverser.llvm"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "serayuzgur.crates"
vscode "sgryjp.japanese-word-handler"
vscode "skyapps.fish-vscode"
vscode "sswg.swift-lang"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "toba.vsfire"
vscode "UCSCFormalMethods.Scenic"
vscode "ultram4rine.vscode-choosealicense"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "WakaTime.vscode-wakatime"
vscode "xaver.clang-format"
vscode "ymotongpoo.licenser"
vscode "ziglang.vscode-zig"
vscode "ZixuanChen.vitest-explorer"
vscode "znck.grammarly"
