# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# brew
brew "pkg-config"
brew "gnutls"
brew "libpng"
brew "bash"
brew "chezmoi"
brew "clang-format"
brew "cmake"
brew "curl"
brew "direnv"
brew "fish"
brew "ghq"
brew "git"
brew "gnu-sed"
brew "go"
brew "make"
brew "peco"
brew "pyenv"
brew "rbenv"
brew "tldr"
brew "vim"
brew "volta"
brew "wget"
brew "starship"

# cask
cask "visual-studio-code"
cask "alfred"
cask "google-chrome"
cask "slack"
cask "bartender"
cask "google-japanese-ime"
